20240113044720-protected_access_modifier.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-01 Sun 15:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Protected Access Modifier</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Protected Access Modifier</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org29d8c75">1. Protected Access Modifier</a>
<ul>
<li><a href="#orgeafd9e5">1.1. Simple Example</a></li>
<li><a href="#orgd171a64">1.2. Example</a></li>
<li><a href="#orgfb86e8e">1.3. Negative Example</a>
<ul>
<li><a href="#orgc64b4d2">1.3.1. <span class="underline">Exam Trick</span></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org29d8c75" class="outline-2">
<h2 id="org29d8c75"><span class="section-number-2">1.</span> Protected Access Modifier</h2>
<div class="outline-text-2" id="text-1">
<p>
The <code>protected</code> modifier means the method can be called only from a class in the <b>same</b> <code>package</code> or a <code>subclass</code>.
</p>

<p>
<code>Protected access</code> allows everything that package access does, and more.
The <code>protected access</code> modifier adds the ability to access members of a parent class.
</p>

<p>
For now, we cover the simplest possible use of a <code>subclass</code>.
</p>
</div>


<div id="outline-container-orgeafd9e5" class="outline-3">
<h3 id="orgeafd9e5"><span class="section-number-3">1.1.</span> Simple Example</h3>
<div class="outline-text-3" id="text-1-1">
<p>
In the following example, the  <code>ClownFish (subClass)</code> of the <code>Fish (parentClass)</code>, using the <code>extends</code> keyword to connect them:
</p>

<p>
By <code>extending</code> a <code>class</code>, the <code>subclass</code> gains access to all <b>protected and public</b> members of the <code>parent class</code>, as if they were declared in the <code>subclass</code>.
</p>


<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Fish</span> {}
<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">ClownFish</span> <span class="org-keyword">extends</span> <span class="org-type">Fish</span> {}
</pre>
</div>


<p>
If the two classes are in the same package, then the subclass also gains access to all <code>package members</code>.
</p>
</div>
</div>

<div id="outline-container-orgd171a64" class="outline-3">
<h3 id="orgd171a64"><span class="section-number-3">1.2.</span> Example</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-java">
<span class="org-comment-delimiter">// </span><span class="org-comment">Parent Class
</span><span class="org-keyword">package</span> pond.<span class="org-constant">shore</span>;

<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Bird</span> {
    <span class="org-keyword">protected</span> <span class="org-type">String</span> <span class="org-variable-name">text</span> = <span class="org-string">"floating"</span>;
    <span class="org-keyword">protected</span> <span class="org-type">void</span> <span class="org-function-name">floatInWater</span>() {
        System.out.print(text); <span class="org-comment-delimiter">// </span><span class="org-comment">protected access is ok
</span>    }
}

<span class="org-comment-delimiter">// </span><span class="org-comment">subclass (Different package than Bird):
</span><span class="org-keyword">package</span> pond.<span class="org-constant">goose</span>;

<span class="org-keyword">import</span> <span class="org-constant">pond</span>.<span class="org-constant">shore</span>.<span class="org-type">Bird</span>;

<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Gosling</span> <span class="org-keyword">extends</span> <span class="org-type">Bird</span> {
    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">swim</span>() {
        floatInWater(); <span class="org-comment-delimiter">// </span><span class="org-comment">protected access is ok
</span>        System.out.print(text); <span class="org-comment-delimiter">// </span><span class="org-comment">protected access is ok
</span>    }
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">args</span>) {
        <span class="org-keyword">new</span> <span class="org-type">Gosling</span>().swim();
    }
}
</pre>
</div>

<p>
(Above) <b>Extending</b> means creating a <code>subclass</code> that has access to any <code>protected</code> or <code>public members</code> of the <code>parentClass</code>.
Running this program prints floating twice: once from calling <code>floatInWater()</code>, and once from the print statement in <code>swim()</code>.
Since <code>Gosling</code> is a <code>subclass</code> of <code>Bird</code>, it can access these members even though it is in a different package.
</p>

<p>
Remember that <code>protected</code> also gives us access to everything that <a href="20240112062023-package_access_modifier.html#ID-0d8e8caf-96d3-4fd2-b0ae-460b7b93d6ae">package access</a> does.
This means a <code>class</code> in the <b>same package</b> as <code>Bird</code> can access its <b>protected</b> members.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">package</span> pond.<span class="org-constant">shore</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">Same package as Bird
</span>
<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">BirdWatcher</span> {
    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">watchBird</span>() {
        <span class="org-type">Bird</span> <span class="org-variable-name">bird</span> = <span class="org-keyword">new</span> <span class="org-type">Bird</span>();
        bird.floatInWater(); <span class="org-comment-delimiter">// </span><span class="org-comment">protected access is ok
</span>        System.out.print(bird.text); <span class="org-comment-delimiter">// </span><span class="org-comment">protected access is ok
</span>    }
}
</pre>
</div>

<p>
Since <code>Bird</code> and <code>BirdWatcher</code> are in the <b>same package</b>, <code>BirdWatcher</code> can access its protected members
</p>
</div>
</div>

<div id="outline-container-orgfb86e8e" class="outline-3">
<h3 id="orgfb86e8e"><span class="section-number-3">1.3.</span> Negative Example</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<code>BirdWatcherFromAfar</code> is <b>not in the same package</b> as <code>Bird</code>, and it <b>doesn’t</b> inherit from <code>Bird</code> therefore it <b>cannot</b> access the members from <code>Bird</code>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">package</span> pond.<span class="org-constant">inland</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">Different package than Bird
</span>
<span class="org-keyword">import</span> <span class="org-constant">pond</span>.<span class="org-constant">shore</span>.<span class="org-type">Bird</span>;

<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">BirdWatcherFromAfar</span> { <span class="org-comment-delimiter">// </span><span class="org-comment">Not a subclass of Bird
</span>    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">watchBird</span>() {
        <span class="org-type">Bird</span> <span class="org-variable-name">bird</span> = <span class="org-keyword">new</span> <span class="org-type">Bird</span>();
        bird.floatInWater(); <span class="org-comment-delimiter">// </span><span class="org-comment">DOES NOT COMPILE
</span>        System.out.print(bird.text); <span class="org-comment-delimiter">// </span><span class="org-comment">DOES NOT COMPILE
</span>    }
}
</pre>
</div>
</div>


<div id="outline-container-orgc64b4d2" class="outline-4">
<h4 id="orgc64b4d2"><span class="section-number-4">1.3.1.</span> <span class="underline">Exam Trick</span></h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">package</span> pond.<span class="org-constant">swan</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">Different package than Bird
</span>
<span class="org-keyword">import</span> <span class="org-constant">pond</span>.<span class="org-constant">shore</span>.<span class="org-type">Bird</span>;

<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Swan</span> <span class="org-keyword">extends</span> <span class="org-type">Bird</span> { <span class="org-comment-delimiter">// </span><span class="org-comment">Swan is a subclass of Bird
</span>    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">swim</span>() {
        floatInWater(); <span class="org-comment-delimiter">// </span><span class="org-comment">LINE 5: protected access is ok
</span>        System.out.print(text); <span class="org-comment-delimiter">// </span><span class="org-comment">LINE 6: protected access is ok
</span>    }
    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">helpOtherSwanSwim</span>() {
        <span class="org-type">Swan</span> <span class="org-variable-name">other</span> = <span class="org-keyword">new</span> <span class="org-type">Swan</span>(); <span class="org-comment-delimiter">// </span><span class="org-comment">LINE 9
</span>
        other.floatInWater(); <span class="org-comment-delimiter">// </span><span class="org-comment">LINE 10: subclass access to superclass
</span>        System.out.print(other.text); <span class="org-comment-delimiter">// </span><span class="org-comment">LINE 11: subclass access to superclass
</span>    }

    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">helpOtherBirdSwim</span>() {
        <span class="org-type">Bird</span> <span class="org-variable-name">other</span> = <span class="org-keyword">new</span> <span class="org-type">Bird</span>(); <span class="org-comment-delimiter">// </span><span class="org-comment">LINE: 14
</span>
        other.floatInWater(); <span class="org-comment-delimiter">// </span><span class="org-comment">LINE 15: DOES NOT COMPILE
</span>        System.out.print(other.text); <span class="org-comment-delimiter">// </span><span class="org-comment">LINE 16: DOES NOT COMPILE
</span>    }
}
</pre>
</div>

<p>
<code>Swan</code> is not in the same package as <code>Bird</code> but does <code>extend</code> it, which implies it has <b>access</b> to the <code>protected</code> members of <code>Bird</code> since it is a <code>subclass</code>.
</p>
</div>

<ol class="org-ol">
<li><a id="orgada4a71"></a>Inheritance<br />
<div class="outline-text-6" id="text-1-3-1-0-1">
<ul class="org-ul">
<li><code>Lines 5 and 6</code> refer to <b>protected</b> members via <i>inheriting</i> them.</li>
</ul>
</div>
</li>

<li><a id="org4009acc"></a>Instantiation<br />
<div class="outline-text-6" id="text-1-3-1-0-2">
<p>
<code>Lines 10 and 11</code> also successfully use <b>protected</b> members of <code>Bird</code>.
</p>

<p>
This is allowed because these lines refer to a <code>Swan</code> object. <code>Swan</code> inherits from <code>Bird</code>, so this is okay.
(It is sort of a two-phase check.)
</p>

<p>
The <code>Swan</code> class is allowed to use <b>protected</b> members of <code>Bird</code>, and we are <b>referring</b> to a <code>Swan</code> object.
</p>

<p>
(Granted, it is a Swan object created on <code>line 9</code> rather than an inherited one, but it is still a Swan object.)
</p>
</div>
</li>

<li><a id="orga7132a1"></a>Failed Compilation<br />
<div class="outline-text-6" id="text-1-3-1-0-3">
<p>
<code>Lines 15 and 16</code> do <b>not</b> compile.
</p>

<p>
Wait a minute. They are almost exactly the same as <code>lines 10 and 11</code>!
</p>

<p>
There’s one key difference.
</p>

<p>
This time a <code>Bird</code> <b>reference</b> is used rather than <b>inheritance</b>.
</p>

<p>
It is created on <code>Line 14</code>.
</p>

<p>
<code>Bird</code> is in a <b>different</b> package, and this code isn’t <b>inheriting</b> from <code>Bird</code>, so it doesn’t get to use <b>protected members</b>.
</p>


<p>
Say what, now? We just got through saying repeatedly that <code>Swan</code> inherits from <code>Bird</code>. And it does.
</p>

<p>
However, the <b>variable reference isn’t</b> <code>Swan</code>.
</p>

<p>
The code just happens to be in the <code>Swan</code> class.
</p>
</div>
</li>
</ol>

<li><a id="orged06510"></a>Rules<br />
<div class="outline-text-5" id="text-1-3-1-1">
<p>
The <b>protected</b> rules apply under two scenarios:
</p>

<ul class="org-ul">
<li>A <code>member</code> is used without <i>referring</i> to a <b>variable</b>.
(This is the case on <code>lines 5 and 6</code>. In this case, we are taking advantage of <b>inheritance</b>, and <b>protected access is allowed</b>.)</li>

<li>A <code>member</code> is used <i>through</i> a <b>variable</b>.
(This is the case on <code>lines 10, 11, 15, and 16</code>. In this case, the rules for the <code>reference</code> type of the variable are what matter. If it is a <code>subclass</code>, <b>protected access is allowed</b>.
If it is the <code>parentClass</code> it does <b>not</b> allow access.)</li>
</ul>
</div>
</li>
</ol>
</div>
</div>
</div>
</div>
</body>
</html>
